{"listOfScientists":[{"firstName":"Isaac","lastName":"Newton","years":"1643 – 1727","picUrl":"http://listverse.com/wp-content/uploads/2009/02/godfreykneller-isaacnewton-1689.jpg.jpeg","bio":"Newton was an English physicist, mathematician, astronomer, natural philosopher, alchemist, theologian and one of the most influential men in human history. His Philosophiæ Naturalis Principia Mathematica, published in 1687, is considered to be the most influential book in the history of science. In this work, Newton described universal gravitation and the three laws of motion, laying the groundwork for classical mechanics, which dominated the scientific view of the physical universe for the next three centuries and is the basis for modern engineering. Newton showed that the motions of objects on Earth and of celestial bodies are governed by the same set of natural laws by demonstrating the consistency between Kepler’s laws of planetary motion and his theory of gravitation, thus removing the last doubts about heliocentrism and advancing the scientific revolution. In mechanics, Newton enunciated the principles of conservation of momentum and angular momentum. In optics, he built the first “practical” reflecting telescope and developed a theory of color based on the observation that a prism decomposes white light into a visible spectrum. He also formulated an empirical law of cooling and studied the speed of sound. In mathematics, Newton shares the credit with Gottfried Leibniz for the development of the differential and integral calculus. He also demonstrated the generalized binomial theorem, developed the so-called “Newton’s method” for approximating the zeroes of a function, and contributed to the study of power series. Newton’s stature among scientists remains at the very top rank, as demonstrated by a 2005 survey of scientists in Britain’s Royal Society asking who had the greater effect on the history of science, Newton was deemed much more influential than Albert Einstein."},{"firstName":"Albert","lastName":"Einstein","years":"1879 – 1955","picUrl":"http://listverse.com/wp-content/uploads/2009/02/albert-einstein-at-beach-1945-celebrities-28954.jpg.jpeg","bio":"Einstein, a German physicist, is best known for his theory of relativity and specifically mass–energy equivalence, expressed by the equation E = mc2. Einstein received the 1921 Nobel Prize in Physics “for his services to Theoretical Physics, and especially for his discovery of the law of the photoelectric effect. Einstein’s many contributions to physics include his special theory of relativity, which reconciled mechanics with electromagnetism, and his general theory of relativity, which was intended to extend the principle of relativity to non-uniform motion and to provide a new theory of gravitation. His other contributions include advances in the fields of relativistic cosmology, capillary action, critical opalescence, classical problems of statistical mechanics and their application to quantum theory, an explanation of the Brownian movement of molecules, atomic transition probabilities, the quantum theory of a monatomic gas, thermal properties of light with low radiation density (which laid the foundation for the photon theory), a theory of radiation including stimulated emission, the conception of a unified field theory, and the geometrization of physics. Einstein published over 300 scientific works and over 150 non-scientific works. The physics community reveres Einstein, and in 1999 Time magazine named him the “Person of the Century”. In wider culture the name “Einstein” has become synonymous with genius."},{"firstName":"Nikola","lastName":"Tesla","years":"1856 – 1943","picUrl":"http://listverse.com/wp-content/uploads/2009/02/nikola-tesla.jpg.jpeg","bio":"Tesla was a Serbian engineer and inventor who is often described as the most important scientist and inventor of the modern age, a man who “shed light over the face of Earth”. He is best known for many revolutionary contributions in the field of electricity and magnetism in the late 19th and early 20th centuries. Tesla’s patents and theoretical work formed the basis of modern alternating current electric power (AC) systems, including the polyphase power distribution systems and the AC motor, with which he helped usher in the Second Industrial Revolution. Contemporary biographers of Tesla have regarded him as “The Father of Physics”, “The man who invented the twentieth century” and “the patron saint of modern electricity.” Aside from his work on electromagnetism and electromechanical engineering, Tesla has contributed in varying degrees to the establishment of robotics, remote control, radar and computer science, and to the expansion of ballistics, nuclear physics, and theoretical physics. In 1943, the Supreme Court of the United States credited him as being the inventor of the radio. Many of his achievements have been used, with some controversy, to support various pseudosciences, UFO theories, and early New Age occultism."}]}